# ************************

password1 = input("Введите пароль\n")
password2 = input("Повторите пароль\n")

if password1 == password2:
    print("Пароль принят")
else:
    print("Пароль не принят")

# ************************

p = int(input("Введите номер места\n"))

if p % 2 == 0:
    print("Верхнее место")
else:
    print("Нижнее место")

if p <= 36:
    print("Купе")
else:
    print("Боковое")

# ************************

y = int(input("Введите год\n"))

if y % 4 == 0 and y % 100 != 0:
    print("Год ", y, " - високосный")
elif y % 400 == 0:
    print("Год ", y, " - високосный")
else:
    print("Этот год не високосный")

# ************************

a = input("Введите первый цвет\n")

if a != "желтый" and a != "синий" and a != "красный":
    print("Ошибка")
else:
    b = input("Введите второй цвет\n")

    if b != "желтый" and b != "синий" and b != "красный":
        print("Ошибка")
    else:
        if a == "желтый" and b == "синий" or b == "желтый" and a == "синий":
            print("Зеленый")
        elif a == "желтый" and b == "красный" or b == "желтый" and a == "красный":
            print("Оранжевый")
        elif a == "синий" and b == "красный" or b == "синий" and a == "красный":
            print("Фиолетовый")
        else:
            print("Это одинаковые цвета")

# ************************
